#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-yhXmWxGcQuHPCToD

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:1]
aws_default_subnet.default_az3: Refreshing state... [id=subnet-0da4846d7cfac02b0]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_apigatewayv2_api.lambda: Refreshing state... [id=o2funagwhd]
aws_default_subnet.default_az2: Refreshing state... [id=subnet-09b88a8666c31e6f0]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-09cdb02441953a91c]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-09f07ce7741d9fad5]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220615085410615600000002]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220615085410689200000004]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220615085410645700000003]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220615085410731100000005]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220615085410752400000007]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-20220615085436140500000008]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220615085410747200000006]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=14l1e99]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=12yklf5]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-094cc2190f1a4358c]
aws_efs_mount_target.nuclei_efs_mount_target3: Refreshing state... [id=fsmt-05fae0a2843af8554]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-03d4de5397812cff0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.scanner will be created
  + resource "aws_cloudwatch_log_group" "scanner" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/scanner"
      + retention_in_days = 3
      + tags_all          = (known after apply)
    }

  # aws_iam_role_policy_attachment.scanner_policy_attach_efs_access will be created
  + resource "aws_iam_role_policy_attachment" "scanner_policy_attach_efs_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonElasticFileSystemClientReadWriteAccess"
      + role       = "scanner_role"
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-15T08:54:36.066+0000" -> (known after apply)
      ~ source_code_hash               = "jXnWiwShTiauvLvSIuDDv+WLNzA9F1s4BzA9oaTtqlE=" -> "b4nEmDgedA95lOMptZLUN15nBCTLbbM/XFyz0kvneiw="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scanner will be created
  + resource "aws_lambda_function" "scanner" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "artifacts/scanner_lambda.zip"
      + function_name                  = "scanner"
      + handler                        = "package.scanner.lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::847035122536:role/scanner_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "wTOIpQ/FQ/R1hDSyCJYJtEujkDb22jXbjRvvIrfPPo0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "mountPath" = "/mnt/nuclei"
              + "nucleiUrl" = "https://github.com/projectdiscovery/nuclei/releases/download/v2.7.2/nuclei_2.7.2_linux_amd64.zip"
              + "sqsUrl"    = "https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + file_system_config {
          + arn              = "arn:aws:elasticfilesystem:us-west-2:847035122536:access-point/fsap-09f07ce7741d9fad5"
          + local_mount_path = "/mnt/nuclei"
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dfa3e4d75f7cdb3a",
            ]
          + subnet_ids         = [
              + "subnet-09b88a8666c31e6f0",
              + "subnet-0da4846d7cfac02b0",
              + "subnet-0e9b3892f4f02491c",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-15T08:54:32.640+0000" -> (known after apply)
      ~ source_code_hash               = "1LO5/YjSopcyoRLfT4On2ZXP5oGL0cGAMzkU8VtRd5I=" -> "PrSx8F+LM02pMdEjPva61IJO/yrL4cjeYWUHtdKwqwc="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*